app/Services/RegistryService.php

select * from `reports` where `reports`.`registry_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 52) and `workspace_id` = 7 order by `expiry_date` desc
---
    public function getRegistriesWithLatestReport(int $workspaceId): array|Collection|_IH_Registry_C
    {
        return Registry::with(['reports' => function ($query) use ($workspaceId) {
            $query->where('workspace_id', $workspaceId)
                ->latest('expiry_date');
        }])->whereHas('workspaces', function ($query) use ($workspaceId) {
            $query->where('workspace_id', $workspaceId);
        })->get();