app/Http/Middleware/HandleInertiaRequests.php

    public function share(Request $request): array
    {

        $user = auth()->user();

        $canManageProject = false;
        $canViewProject = false;
        $canCreateReport = false;

        if ($user && $user->project_id) {
            // Assuming you use route model binding or retrieve it somehow
            $project = Project::find($user->project_id);
            $canManageProject = $project ? $user->can('manage', $project) : false;
            $canViewProject = $project ? $user->can('view', $project) : false;
            $canCreateReport = $project ? $user->can('create', Report::class) : false;
        }

        return [
            ...parent::share($request),
            'auth' => [
                'user' => $request->user()?->load('workspaces'),
            ],
            'flash' => function () use ($request) {
                return [
                    'success' => $request->session()->get('success'),
                    'error' => $request->session()->get('error'),
                ];
            },
            'ziggy' => fn () => [
                ...(new Ziggy)->toArray(),
                'location' => $request->url(),
            ],
            'route' => $request->route()->uri,
            'permissions' => [
                'canManageProject' => $canManageProject,
                'canViewProject' => $canViewProject,
                'canCreateReport' => $canCreateReport,
            ],
            'projectId' => session('project_id'),
---
select * from `projects` where `projects`.`id` = 3 and `projects`.`deleted_at` is null limit 1
select `workspaces`.*, `user_workspace`.`user_id` as `pivot_user_id`, `user_workspace`.`workspace_id` as `pivot_workspace_id` from `workspaces` inner join `user_workspace` on `workspaces`.`id` = `user_workspace`.`workspace_id` where `user_workspace`.`user_id` in (10) and `project_id` = 3