app/Http/Controllers/Workspace/RegistryController.php

    public function index(Request $request, Workspace $workspace): Response
    {
        $this->authorize('view', $workspace);

        $registriesQuery = $this->registryService->getRegistriesWithLatestReportQuery($workspace->id);

        $registries = $registriesQuery
            ->applyFilters($request)
            ->paginate(10)
            ->withQueryString();
---
select * from `reports` where `reports`.`registry_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 52)

    public function show(Request $request, Workspace $workspace, Registry $registry)
    {
        $this->authorize('view', $workspace);

        $currentReport = $registry->reports()
            ->where('workspace_id', $workspace->id)
            ->latest('expiry_date')
            ->first();

        $otherReports = $registry->reports()
            ->where('workspace_id', $workspace->id)
            ->when($currentReport, function ($query) use ($currentReport) {
                return $query->where('id', '!=', $currentReport->id);
            })->applyFilters($request)->get();
---
select * from `reports` where `reports`.`registry_id` = 52 and `reports`.`registry_id` is not null and `workspace_id` = 7 order by `expiry_date` desc limit 1
select * from `reports` where `reports`.`registry_id` = 52 and `reports`.`registry_id` is not null and `workspace_id` = 7 and `id` != 17