app/Http/Controllers/Workspace/ReportController.php

    public function create(Project $project, Workspace $workspace, Request $request): Response
    {

        $registryId = $request->input('registry', null);
        $registry = $registryId ? Registry::find($registryId) : null;

        return Inertia::render('Workspaces/Registries/Reports/Create', [
            'workspace' => $workspace,
            'registries' => $workspace->registries()->get(),
---
select `registries`.*, `registry_workspace`.`workspace_id` as `pivot_workspace_id`, `registry_workspace`.`registry_id` as `pivot_registry_id` from `registries` inner join `registry_workspace` on `registries`.`id` = `registry_workspace`.`registry_id` where `registry_workspace`.`workspace_id` = 7