app/Http/Controllers/Workspace/ReportController.php

select * from `projects` where `projects`.`id` = 3 and `projects`.`deleted_at` is null limit 1
insert into `reports` (`report_date`, `expiry_date`, `report_path`, `created_by_user_id`, `project_id`, `workspace_id`, `registry_id`, `updated_at`, `created_at`) values ('2024-03-26', '2024-09-26', '03-26-2024_06-17-28_3_7_Hello.jpg', 10, 3, 7, 52, '2024-03-26 06:17:29', '2024-03-26 06:17:29')
---
    public function store(Workspace $workspace, Registry $registry, StoreReportRequest $request)
    {
        $project = Project::find(session('project_id'));

        $reportDate = new Carbon($request->report_date);
        $expiryDate = (clone $reportDate)->addMonths($registry->validity_period);

        $file = $request->file('report_path');
        $date = Carbon::now()->format('m-d-Y_H-i-s');

        $fileName = preg_replace('/[^A-Za-z0-9\-_.]/', '_', $date.'_'.$project->id.'_'.$workspace->id.'_'.$registry->name.'.'.$file->extension());
        $file->storeAs($project->id.'/'.$workspace->id.'/'.$registry->id, $fileName, 'reports');

        Report::create([
            'report_date' => $reportDate,
            'expiry_date' => $expiryDate,
            'report_path' => $fileName,
            'created_by_user_id' => Auth::id(),
            'project_id' => $project->id,
            'workspace_id' => $workspace->id,
            'registry_id' => $registry->id,

        ]);

select * from `projects` where `projects`.`id` = 3 and `projects`.`deleted_at` is null limit 1
---
    public function show(Workspace $workspace, Registry $registry, Report $report)
    {
        $project = Project::find(session('project_id'));

update `reports` set `report_date` = '2024-03-24', `expiry_date` = '2025-03-24', `updated_by_user_id` = 10, `reports`.`updated_at` = '2024-03-26 06:14:29' where `id` = 12
---
    public function update(Request $request, Workspace $workspace, Registry $registry, Report $report)
    {

        $report_date = new Carbon($request->report_date);
        $expiryDate = $report_date->addMonths($registry->validity_period);

        $report->report_date = $request->report_date;
        $report->expiry_date = $expiryDate;
        $report->updated_by_user_id = Auth::id();
        $report->save();

delete from `reports` where `id` = 12
---
    public function destroy(Project $project, Workspace $workspace, Registry $registry, Report $report)
    {
        Storage::disk('reports')->delete($project->id.'/'.$workspace->id.'/'.$registry->id.'/'.$report->report_path);

        $report->delete();