app/Http/Controllers/ProjectController.php

    public function __invoke(): Response
    {
        $project = Project::find(session('project_id'));
---
select * from `projects` where `projects`.`id` = 3 and `projects`.`deleted_at` is null limit 1