app/Http/Controllers/Project/RegistryController.php

select * from `projects` where `projects`.`id` = 3 and `projects`.`deleted_at` is null limit 1
select * from `registries` where `project_id` = 3 or `project_id` is null limit 10 offset 0
select count(*) as aggregate from `registries` where `project_id` = 3 or `project_id` is null
---
    public function index(Request $request): Response
    {
        $project = Project::find(session('project_id'));

        $this->authorize('manage', $project);

        if (Auth::user()->isSuperAdmin()) {
            $registries = Registry::applyFilters($request)
                ->paginate(10)
                ->withQueryString();